README.md
```mermaid
classDiagram

namespace state {

    class Role {
        <<enumeration>>
        Plante
        Zombie
    }

    class Config {
        vector~int~ zombies
        vector~int~ plants
        string server_ip
        int port
    }

    class State
}

State --> Role
State --> Config
State --> TcpSocket

namespace network {

    class IpAddr {
        <<interface>>
        Version() int
    }

    class Ipv4Addr
    class Ipv6Addr

    class Socket {
        SetAddr(IpAddr)
        Bind()
        Close()
    }

    class TcpSocket {
        <<>>
        Connect(IpAddr)
        Send(data) size
        Recv(buffer) size
    }

    class Listener {
        Bind(IpAddr)
        Listen()
        Accept() TcpSocket
        Close()
    }

    class Packet {
        Recv(TcpSocket)$ Packet
        Send(TcpSocket)
        Write(data) size
        Read() data
    }
}

IpAddr <|.. Ipv4Addr
IpAddr <|.. Ipv6Addr
Socket --> IpAddr
Socket <|-- TcpSocket
Listener --> TcpSocket
Packet ..> TcpSocket

class Mod {
    <<interface>>
    Enable()
    Disable()
}

class ModLoader {
    Add(Mod)
    Load()
}

ModLoader o-- Mod

class RemoveDefaultPlants
Mod <|.. RemoveDefaultPlants

class SetSunAmount
Mod <|.. SetSunAmount

class Hook {
    <<interface>>
    #From() address
    #To() address
    #JumpRet() optional~address~
}

Mod <|-- Hook

class BeforeLoadLevel
Hook <|.. BeforeLoadLevel
BeforeLoadLevel ..> CreateZombie
BeforeLoadLevel ..> CreatePlant
BeforeLoadLevel ..> LevelEnd
BeforeLoadLevel ..> Listener
BeforeLoadLevel ..> State

class AfterLoadLevel
Hook <|.. AfterLoadLevel
AfterLoadLevel ..> RemoveDefaultPlants
AfterLoadLevel ..> InitSlots

class InitSlots
Hook <|.. InitSlots
InitSlots ..> State

class LevelEnd
Hook <|.. LevelEnd
LevelEnd ..> State
LevelEnd ..> Packet

class CreateZombie
Hook <|.. CreateZombie
CreateZombie ..> State
CreateZombie ..> Packet

class CreatePlant
Hook <|.. CreatePlant
CreatePlant ..> State
CreatePlant ..> Packet

class Startup {
    Run()
    Stop()
}

Startup --> ModLoader
Startup --> State
```
